Tekla Open API Reference for Tekla Structures 2025
RebarStrand Properties
The RebarStrand type exposes the following members.
Properties
Name | Description
Class
 Gets or sets the class of the reinforcement. The class is used to group reinforcements.
 (Inherited from Reinforcement.)
EndPoint
 The end point of the single strand (the start point and end point define the length of the strand).
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
OFFSET_TYPE_COVER_THICKNESS
 (Inherited from Reinforcement.)
EndPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the second end of the bar.
 (Inherited from Reinforcement.)
Father
 Gets or sets the father object of the reinforcement; the model object instance to operate on.
 (Inherited from Reinforcement.)
FromPlaneOffset
 Gets or sets the offset value from the part surface.
 (Inherited from Reinforcement.)
Grade
 Gets or sets the steel grade of the reinforcing bar. The grade indicates the strength of the steel used in reinforcing bars. It can also indicate other factors, such as the weldability or surface deformations of the bar.
 (Inherited from Reinforcement.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
InputPointDeformingState
 Gets or sets the reinforcement input point deforming state.
 (Inherited from Reinforcement.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the reinforcement.
 (Inherited from Reinforcement.)
NumberingSeries
 Gets or sets the numbering series of the reinforcement.
 (Inherited from Reinforcement.)
OnPlaneOffsets
 Not supported.
Patterns
 An array list of polygons that represents the patterns of the rebar strand. Give the strand positions in the same order as for the first pattern. The maximum number of patterns is 20.
PullPerStrand
 The pull per strand (N).
RadiusValues
 Gets or sets the radius value(s) of the bends in the bar.
 (Inherited from Reinforcement.)
Size
 The size of the reinforcement.
StartPoint
 The start point of the single strand (the start point and end point define the length of the strand).
StartPointOffsetType
 Gets or sets the type of the start point offset is either OFFSET_TYPE_LEG_LENGTH or OFFSET_TYPE_COVER_THICKNESS.
 (Inherited from Reinforcement.)
StartPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the first end of the bar.
 (Inherited from Reinforcement.)
Unbondings
 An array list of StrandUnbondingData items.
Top
See Also
Reference
RebarStrand Class
Tekla.Structures.Model Namespace